import en from './en';
import type { LanguageSchema } from '.';

export default {
	...en,
	language: {
		button: 'Язык',
		name: 'Русский',
	},
	registrationsOpen: 'Регистрация начинается 26 июня',
	registrationsCta: 'Присоединится к Discord',
	info: {
		dates: 'будет открыт с 30 июня по 30 сентября',
		slots: '40 игроков',
		version: '',
		mode: 'сложная сложность, включены плагины',
	},
	about: {
		title: 'О Habile SMP',
		overview:
			'Habile SMP (Сервер по выживанию) - это многопользовательский сервер Minecraft, где игроки со всего мира собираются вместе, чтобы строить, сражаться, выживать и творить!',
		registration:
			"Он предоставляется бесплатно Clembs'ом. Любой желающий может зарегистрироваться и играть, как ему вздумается, поскольку никаких конкретных целей не ставится.",
		livestreaming:
			'Приветствуются прямые трансляции (с хэштегом #habile-smp), создание команд и общение на сервере Discord.',
		plugins:
			'Для расширения возможностей ванильного Minecraft используется несколько плагинов, датапаков для генерации поведения и местности.',
		detailsCta: 'Подробности',
		technicals: {
			title: 'Конфигурация сервера',
			config: 'Конфигурация сервера',
			world: 'Настройки мира',
			datapacks: 'Датапаки',
			plugins: 'плагины',
			soon: 'Скоро...',
		},
	},
	gettingStarted: {
		title: 'Приступая к игре',
		step1: 'Установите Майнкрафт версии 1.20.6 (Не последнюю версию!)',
		protip: {
			title: 'Про-совет!',
			description: (sodium: string, optifine: string) =>
				`Для лучшего опыта установите <a href="${sodium}" target="_blank" rel="noopener noreferrer">модпак для повышения производительности</a>, если вы используете видеокарту. В ином случае установите <a href="${optifine}" target="_blank" rel="noopener noreferrer">OptiFine</a>.`,
		},
		step2: 'Когда игра запустится, нажмите "Сетевая игра".',
		step3: 'Нажмите "Добавить" и введите smp.clembs.com в адресную строку.',
		step4: 'Нажмите "Готово" и затем два раза нажмите на добавленный сервер.',
		step5:
			'Вам будет предложено создать пароль, чтобы предотвратить кражу данных.<br />Как только это будет сделано, войдите, и вы в игре!',
	},
	rules: {
		title: 'Правила',
		cheats:
			'Нельзя использовать читы, взломы, абьюз эксплоиты или создавание лагов с намеренной целью.',
		oneProfile: 'Используйте только один Майнкрафт аккаунт чтобы заходить на сервер.',
		attacks: 'Не пытайтесь кибератаковать сервер (DDoS, и т.д.)',
		commonSense:
			'Руководствуйтесь здравым смыслом, не будьте вспыльчивыми, не используйте оскорблений и т.д.',
		englishOnly:
			'Основной язык публичного чата - <b>английский</b> (Использовать переводы допустимо).',
		everythingElse: 'Все остальное, включая грифинг, убийство икру и т. д., <b>разрешено</b>.',
	},
	credits: 'DankNil, Sovencho & SuperKnuckles',
} satisfies LanguageSchema;
